# 2.1[10]: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом.
#  Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки 
#  были повернуты вверх одной и той же стороной. Выведите минимальное количество монет, 
#  которые нужно перевернуть. Количество монет и их положение (0 или 1) пользователь вводит
#  с клавиатуры.
# Примеры/Тесты:
# Введите кол-во монет>? 5
# Положение монеты 0: 0 или 1>? 1
# ...
# 1 0 1 1 0
# Кол-во монет, чтобы перевернуть: 2

count_coin = int(input("Введите количество монеток:"))

coin_position = 0
heads = 0 # орел
tails = 0 # решка
i = 0
for i in range(count_coin):
    coin_position = int(input("Введите положение монеты (0 - решка; 1 - орел):"))
    if coin_position == 0:
        heads += 1
    else:
        tails += 1
min(heads, tails)

print(min(heads, tails))


